wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/trustly-create-payment-request.json

{
  "amount": 100000,
  "currency": "USD",
  "country": "US",
  "payment_method": {
    "method": "trustly",
    "country": "US",
    "currency": "USD"
  },
  "external_identifier": "907184.1",
  "buyer": {
    "external_identifier": "lorem@ipsum",
    "billing_details": {
      "email_address": "lorem@ipsum"
    }
  },
  "statement_descriptor": {
    "description": "Wikimedia Foundation"
  }
}
