wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/trustly-recurring-create-payment-response.json

{
    "type": "transaction",
    "id": "f1da9c44-900d-4c44-8921-e22f0518a933",
    "reconciliation_id": "7MN3TRD6dSvWqzcWAa164h",
    "merchant_account_id": "default",
    "created_at": "2024-11-04T13:53:59.466230+00:00",
    "updated_at": "2024-11-04T13:54:14.598101+00:00",
    "amount": 1000,
    "authorized_amount": 1000,
    "captured_amount": 1000,
    "refunded_amount": 0,
    "currency": "USD",
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "US",
    "external_identifier": "184.2",
    "status": "capture_succeeded",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "trustly",
        "mode": "redirect",
        "label": "Demo Checking Account - 6576",
        "scheme": null,
        "expiration_date": null,
        "approval_url": null,
        "country": "US",
        "currency": "USD",
        "details": null,
        "last_replaced_at": null,
        "fingerprint": null,
        "id": "f40200a5-203e-48fb-a442-28f97803b851",
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "trustly",
    "instrument_type": "redirect_token",
    "error_code": null,
    "payment_service": {
        "id": "12d66526-2ee1-4440-bc28-cf11ca9e9a5c",
        "type": "payment-service",
        "payment_service_definition_id": "trustlyncf-trustly",
        "method": "trustly",
        "display_name": "Trustly (US) - Beta"
    },
    "pending_review": false,
    "buyer": {
        "id": null,
        "type": "buyer",
        "display_name": null,
        "external_identifier": "dadedoyin@wikimedia.org",
        "billing_details": {
            "first_name": "Damilare",
            "last_name": "Adedoyin",
            "email_address": "dadedoyin@wikimedia.org",
            "phone_number": null,
            "address": {
                "city": null,
                "country": "US",
                "postal_code": null,
                "state": null,
                "state_code": null,
                "house_number_or_name": null,
                "line1": null,
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "recurring",
    "merchant_initiated": true,
    "is_subsequent_payment": true,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": "1025489994",
    "three_d_secure": null,
    "payment_service_transaction_id": "1025489998",
    "metadata": null,
    "authorized_at": "2024-11-04T13:53:59.670853+00:00",
    "captured_at": "2024-11-04T13:54:14.584494+00:00",
    "voided_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false
}